Autodesk.Revit.DB.IExportContext.OnLight(Autodesk.Revit.DB.LightNode)
This method marks the beginning of export of a light object.
node:
A node describing the light object.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnRPC(Autodesk.Revit.DB.RPCNode)
This method marks the beginning of export of an RPC object.
node:
A node with asset information about the RPC object.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnFaceBegin(Autodesk.Revit.DB.FaceNode)
This method marks the beginning of a Face to be exported
Remarks:
Note that this method (as well as OnFaceEnd) is invoked only if the custom
exporter was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Face.
Returns:
Return RenderNodeAction. Proceed if you wish to receive geometry (polymesh)
for this face, or return RenderNodeAction.Skip otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnInstanceEnd(Autodesk.Revit.DB.InstanceNode)
This method marks the end of a family instance being exported
node:
An output node that represents a family instance.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnInstanceBegin(Autodesk.Revit.DB.InstanceNode)
This method marks the beginning of a family instance to be exported
Returns:
Return RenderNodeAction.Skip if you wish to skip processing this family instance,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnElementEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of an element being exported
elementId:
The Id of the element that has just been processed
Since:
2014

Autodesk.Revit.DB.IExportContext.OnElementBegin(Autodesk.Revit.DB.ElementId)
This method marks the beginning of an element to be exported
elementId:
The Id of the element that is about to be processed
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext.OnViewEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of a 3D view being exported
elementId:
The Id of the 3D view that has just been processed
Since:
2014

Autodesk.Revit.DB.IExportContext.OnViewBegin(Autodesk.Revit.DB.ViewNode)
This method marks the beginning of a 3D view to be exported
node:
Geometry node associated with the view
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this view,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContext
An interface that is used in custom export to process a Revit model.
Remarks:
An instance of a class that implements this interface is passed in as a
parameter of the Autodesk.Revit.DB.CustomExporter constructor.
The methods of the context are then called at times of exporting entities of the model.
This is a base class for two other interfaces derived from it:
Autodesk::Revit::DB::IPhotoRenderContext and
Autodesk::Revit::DB::IModelExportContext which are both
new since Revit 2016. This base class contains methods that are common
to both the leaf interfaces. Although it is still possible to use classes
deriving directly from this base interface (for backward compatibility),
future applications should implement the new leaf interfaces only.
Since:
2014